#!/bin/bash

init_log() {
    echo "=== Лог очистки файловой системы ===" > "$1"
    echo "Дата начала: $(date "+%Y-%m-%d %H:%M:%S")" >> "$1"
    echo "Метод очистки: $2" >> "$1"
    echo "-----------------------------------" >> "$1"
}

log_entry() {
    echo "$1" >> "$LOG_FILE"
}

finalize_log() {
    echo "-----------------------------------" >> "$LOG_FILE"
    echo "Дата окончания: $(date "+%Y-%m-%d %H:%M:%S")" >> "$LOG_FILE"
    echo "=== Завершение работы ===" >> "$LOG_FILE"
    echo "Лог сохранен в: $LOG_FILE"
}
